app/views/periods/index.html.haml

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]
---
          %td= period.card.lastname
          %td= period.card.firstname