app/views/periods/show.html.haml

  %dt= Card.human_attribute_name(:firstname)
  %dd= @period.card.firstname
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]