app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards = Card.all

INSERT INTO "cards" ("lastname", "firstname", "secondname", "nomer", "insurancepolicy", "typeoftreatment", "pindex", "city", "street", "house", "building", "flat", "telephone", "passportseries", "passportnumber", "passsportfrom", "allergy", "dateofcreation", "passportwhen", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save

UPDATE "cards" SET "typeoftreatment" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["typeoftreatment", "Бесплатно"], ["updated_at", "2017-05-12 20:24:39.911442"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @card.update(card_params)

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 1]]
---
  def destroy
    @card.destroy

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_card
      @card = Card.find(params[:id])