app/controllers/periods_controller.rb

SELECT "periods".* FROM "periods"
---
  def index
    @periods = Period.all

INSERT INTO "periods" ("ward_id", "card_id", "dateofentrance", "reasonofentrance", "dateofissue", "dischargesummary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create

    @period = Period.new(period_params)
    respond_to do |format|
      if @period.save

UPDATE "periods" SET "reasonofentrance" = $1, "updated_at" = $2 WHERE "periods"."id" = $3  [["reasonofentrance", "Жалобы на головные боли1"], ["updated_at", "2017-05-23 18:19:22.056366"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @period.update(period_params)

DELETE FROM "periods" WHERE "periods"."id" = $1  [["id", 2]]
---
  def destroy
    @period.destroy

SELECT  "periods".* FROM "periods" WHERE "periods"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_period
      @period = Period.find(params[:id])