app/controllers/wards_controller.rb

  def index
    @wards = Ward.all
---
SELECT "wards".* FROM "wards"

  def create
    @ward = Ward.new(ward_params)

    respond_to do |format|
      if @ward.save
---
INSERT INTO "wards" ("floor", "nomer", "otdel", "capacity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["floor", 2], ["nomer", 2], ["otdel", "1"], ["capacity", 1], ["created_at", "2017-05-12 15:46:23.973392"], ["updated_at", "2017-05-12 15:46:23.973392"]]

  def update
    respond_to do |format|
      if @ward.update(ward_params)
---
UPDATE "wards" SET "floor" = $1, "nomer" = $2, "updated_at" = $3 WHERE "wards"."id" = $4  [["floor", 1], ["nomer", 1], ["updated_at", "2017-05-12 15:47:05.257395"], ["id", 1]]

  def destroy
    @ward.destroy
---
DELETE FROM "wards" WHERE "wards"."id" = $1  [["id", 2]]

    def set_ward
      @ward = Ward.find(params[:id])
---
SELECT  "wards".* FROM "wards" WHERE "wards"."id" = $1 LIMIT 1  [["id", 2]]